/**************************************************************************************
ÊµÑéÏÖÏó£ºÏ
½ÓÏßËµÃ÷£º µ¥Æ¬»ú-->LED&½»Í¨µÆÄ£¿é(¾ßÌå½ÓÏßÍ¼¿É¼û¿ª·¢¹¥ÂÔ¶ÔÓ¦ÊµÑéµÄ¡°ÊµÑéÏÖÏó¡±ÕÂ½Ú)
		   P00-->D1	
×¢ÒâÊÂÏî£º																				  
***************************************************************************************/

#include "reg52.h"			 //´ËÎÄ¼şÖĞ¶¨ÒåÁËµ¥Æ¬»úµÄÒ»Ğ©ÌØÊâ¹¦ÄÜ¼Ä´æÆ÷
typedef unsigned int u16;	  //¶ÔÊı¾İÀàĞÍ½øĞĞÉùÃ÷¶¨Òå
typedef unsigned char u8;
int a;
sbit LSA=P2^2;
sbit LSB=P2^3;
sbit LSC=P2^4;
sbit k3=P3^2;
sbit k4=P3^3;

u8 code smgduan[17]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,
					0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};//ÏÔÊ¾0~FµÄÖµ

void time0unit()  //¶¨Ê±Æ÷0ÖĞ¶Ï¿ªÆô
{
	TMOD|=0X01;
	TH0=0xFC;
	TL0=0X18;
	ET0=1;
	EA=1;
	TR0=1;
	
}
void inter1()//Íâ²¿ÖĞ¶Ï1¿ªÆô
{
	EA=1;
	EX1=1;
	IT1=1;
}
void delay(u16 i)//Ê±ÑÓº¯Êı£¬´óÔ¼ÑÓÊ±1us
{
	while(i--);
}
void Time0() interrupt 1//¶¨Ê±Æ÷1ÖĞ¶Ïº¯Êı£¬ÊµÏÖ1sµÄ¼ÆÊ±£¬
{												//Í¬Ê±ÊµÏÖÃë±íÏÔÊ¾Êı×ÖµÄ¼õÉÙ
	static u16 i;

	TH0=0xFC;//¸ø¶¨Ê±Æ÷1¸³Öµ
	TL0=0x18;
	i++;
		if(i==1000)
			{
				i=0;
				a--;
			}	
}

void		Int1()  interrupt 2//°´¼üÖÃÁãº¯Êı£¬Ê¹ÓÃK4¡úÍâ²¿ÖĞ¶Ï1
{
	delay(500);
	if(k4==0)
	{	
			a=59;
	}
}

void main()
{
	inter1();
	time0unit();
	a=59;
	while(1)
	{
		
		if(a>=0)
		{
			LSA=0;LSB=0;LSC=0;
			P0=smgduan[a%10];
			delay(1100);//ÑÓÊ±¼õÉÙLEDÓàêÍµÄÓ°Ïì
			LSA=0;LSB=0;LSC=1;
			P0=smgduan[a/10];
			delay(1100);
		}
		else
		{
			a=59;//×Ô¶¯¸´Î»
		}
	}
}

